STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_Power_Peripheral/STM32_WPAN/App/app_ble.c
  udn = LL_FLASH_GetUDN();

  if (udn != 0xFFFFFFFF)
  {
    company_id = LL_FLASH_GetSTCompanyID();
    device_id = LL_FLASH_GetDeviceID();

    /**
     * Public Address with the ST company ID
     * bit[47:24] : 24bits (OUI) equal to the company ID
     * bit[23:16] : Device ID.
     * bit[15:0] : The last 16bits from the UDN
     * Note: In order to use the Public Address in a final product, a dedicated
     * 24bits company ID (OUI) shall be bought.
     */
    a_BdAddrUdn[0] = (uint8_t)(udn & 0x000000FF);
    a_BdAddrUdn[1] = (uint8_t)((udn & 0x0000FF00) >> 8);
    a_BdAddrUdn[2] = (uint8_t)device_id;
    a_BdAddrUdn[3] = (uint8_t)(company_id & 0x000000FF);
    a_BdAddrUdn[4] = (uint8_t)((company_id & 0x0000FF00) >> 8);
    a_BdAddrUdn[5] = (uint8_t)((company_id & 0x00FF0000) >> 16);

    p_bd_addr = (const uint8_t *)a_BdAddrUdn;
  }
  else
  {
    p_otp_addr = OTP_Read(0);
    if (p_otp_addr)
    {
      p_bd_addr = ((OTP_ID0_t*)p_otp_addr)->bd_address;
    }
    else
    {
      p_bd_addr = a_MBdAddr;
    }
  }

  return p_bd_addr;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */
static void Adv_Update(void)
{
  if((BleApplicationContext.Adv_Type == ADV_TYPE) && (BleApplicationContext.Adv_Int_Mode == CFG_ADV_INT_MODE_FAST))
  {
    BleApplicationContext.Custom_Device_Connection_Status = Custom_APP_BLE_FAST_ADV;
    BleApplicationContext.Device_Connection_Status = APP_BLE_FAST_ADV;
    Custom_Adv_Request(Custom_APP_BLE_FAST_ADV);
  }
  else if((BleApplicationContext.Adv_Type == ADV_TYPE) && (BleApplicationContext.Adv_Int_Mode == CFG_ADV_INT_MODE_LP)) 
  {
    BleApplicationContext.Custom_Device_Connection_Status = Custom_APP_BLE_LP_ADV;
    BleApplicationContext.Device_Connection_Status = APP_BLE_LP_ADV;
    Custom_Adv_Request(Custom_APP_BLE_LP_ADV);
  }
  else if((BleApplicationContext.Adv_Type == ADV_TYPE_2) && (BleApplicationContext.Adv_Int_Mode == CFG_ADV_INT_MODE_FAST))
  {
    BleApplicationContext.Custom_Device_Connection_Status = Custom_APP_BLE_ADV_Broadcast;
    Custom_Adv_Request(Custom_APP_BLE_ADV_Broadcast);
  }
  else if((BleApplicationContext.Adv_Type == ADV_TYPE_2) && (BleApplicationContext.Adv_Int_Mode == CFG_ADV_INT_MODE_LP))
  {
    BleApplicationContext.Custom_Device_Connection_Status = Custom_APP_BLE_ADV_Broadcast_LP;
    Custom_Adv_Request(Custom_APP_BLE_ADV_Broadcast_LP);
  }
  else
  {
    APP_DBG_MSG("ADV update failed \n");    
  }
}


static void Custom_Adv_Request(Custom_APP_BLE_ConnStatus_t NewStatus)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  /* Start Fast or Low Power Advertising */
  /* Connection in ADVERTISE mode have to stop the current advertising */
  ret = aci_gap_set_non_discoverable();
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_set_non_discoverable - Stop Advertising Failed , result: %d \n", ret);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_set_non_discoverable - Successfully Stopped Advertising \n");
  }
    
  switch(NewStatus)
  {
    case Custom_APP_BLE_FAST_ADV:
      ret = aci_gap_set_discoverable(ADV_TYPE,
                                     ADV_INTERVAL_MIN,
                                     ADV_INTERVAL_MAX,
                                     CFG_BLE_ADDRESS_TYPE,
                                     ADV_FILTER,
                                     0, 0, 0, 0, 0, 0);
      break;
    
    case Custom_APP_BLE_LP_ADV:
      ret = aci_gap_set_discoverable(ADV_TYPE,
                                     ADV_LP_INTERVAL_MIN,
                                     ADV_LP_INTERVAL_MAX,
                                     CFG_BLE_ADDRESS_TYPE,
                                     ADV_FILTER,
                                     0, 0, 0, 0, 0, 0);
      break;
    
    case Custom_APP_BLE_ADV_Broadcast:
      ret = aci_gap_set_discoverable(ADV_TYPE_2,
                                     ADV_INTERVAL_MIN,
                                     ADV_INTERVAL_MAX,
                                     CFG_BLE_ADDRESS_TYPE,
                                     ADV_FILTER,
                                     0, 0, 0, 0, 0, 0);
      break;
    
    case Custom_APP_BLE_ADV_Broadcast_LP:
      ret = aci_gap_set_discoverable(ADV_TYPE_2,
                                     ADV_LP_INTERVAL_MIN,
                                     ADV_LP_INTERVAL_MAX,
                                     CFG_BLE_ADDRESS_TYPE,
                                     ADV_FILTER,
                                     0, 0, 0, 0, 0, 0);
      break;
    
    
    default:
      break;
  }
  
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_set_discoverable - fail, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_set_discoverable - Success\n");
  }
  
  ret = aci_gap_delete_ad_type(AD_TYPE_TX_POWER_LEVEL);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> delete tx power level - fail, result: 0x%02X\n", ret);
  }
  
  ret = aci_gap_update_adv_data(sizeof(a_AdvData), (uint8_t*) a_AdvData);
  
  switch(BleApplicationContext.Custom_Device_Connection_Status)
  {
    case Custom_APP_BLE_FAST_ADV:
      if (ret != BLE_STATUS_SUCCESS)
      {
          APP_DBG_MSG("==>> Start FAST_IND Advertising Failed , result: %d \n\r", ret);
      }
      else
      {
          APP_DBG_MSG("==>> Success: Start FAST_IND Advertising \n\r");
      }
      break;
    
    case Custom_APP_BLE_LP_ADV:
      if (ret != BLE_STATUS_SUCCESS)
      {
          APP_DBG_MSG("==>> Start LP_IND Advertising Failed , result: %d \n\r", ret);
      }
      else
      {
          APP_DBG_MSG("==>> Success: Start LP_IND Advertising \n\r");
      }
      break;
    
    case Custom_APP_BLE_ADV_Broadcast:
      if (ret != BLE_STATUS_SUCCESS)
      {
          APP_DBG_MSG("==>> Start FAST_BROADCAST Advertising Failed , result: %d \n\r", ret);
      }
      else
      {
          APP_DBG_MSG("==>> Success: Start FAST_BROADCAST Advertising \n\r");
      }
      break;
    
    case Custom_APP_BLE_ADV_Broadcast_LP:
      if (ret != BLE_STATUS_SUCCESS)
        {
            APP_DBG_MSG("==>> Start LP_BROADCAST Advertising Failed , result: %d \n\r", ret);
        }
        else
        {
            APP_DBG_MSG("==>> Success: Start LP_BROADCAST Advertising \n\r");
        }
      break;
    
    default:
      break;
  }  

  return;
}



static void Conn_Int_Update_Req (void)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
